lxd.html
<!DOCTYPE html>
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-11-26 二 00:40 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>LXD</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="css/org.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="theindex.html"> INDEX </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content">
<header>
<h1 class="title">LXD</h1>
</header><nav id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga9e8f4c">LXD Setup</a>
<ul>
<li><a href="#org86bdc9c">Deb or Snap</a></li>
<li><a href="#org4e171dc">Init</a></li>
</ul>
</li>
<li><a href="#orgb2025f0">Snap and Lxd</a>
<ul>
<li><a href="#orga8f5ead">Run lxd in Snap</a></li>
<li><a href="#org7b763fc">Launcn Lxd container</a></li>
<li><a href="#orgd2d6fae">Run snap inside Lxd Container</a></li>
<li><a href="#orgeee63fa">Run Lxd inside Lxd Container</a></li>
<li><a href="#org8f0f001">Run Docker inside Lxd Container</a></li>
<li><a href="#orgf423aad">Use Lxd Container as a Router</a></li>
</ul>
</li>
<li><a href="#org88e8934">Clustering Mode</a>
<ul>
<li><a href="#orgdd3ac39">New Cluster</a></li>
<li><a href="#org1e4a9c7">Join Cluster</a></li>
<li><a href="#orgbe53a27">List Cluster</a></li>
</ul>
</li>
<li><a href="#orgba57208">Database</a>
<ul>
<li><a href="#org410e40c">Global and Local</a></li>
<li><a href="#orgfe40e8d">Lxd sql</a></li>
<li><a href="#org78a1676">Global Schemas</a></li>
<li><a href="#org44dd87e">Local Schemas</a></li>
<li><a href="#orgdbc4f2f">Raft Nodes</a></li>
<li><a href="#orgebc5da4">Cluster nodes</a></li>
<li><a href="#orge148896">Containers</a></li>
</ul>
</li>
<li><a href="#org1f98b03">Network</a></li>
<li><a href="#orgf60ba93">Operations</a>
<ul>
<li><a href="#org825cfd6">Launch Container</a></li>
</ul>
</li>
<li><a href="#orgd0a5b21">Ansible</a>
<ul>
<li><a href="#orgc1ee722">Lxd connection</a></li>
</ul>
</li>
</ul>
</div>
</nav>

<div id="outline-container-orga9e8f4c" class="outline-2">
<h2 id="orga9e8f4c">LXD Setup</h2>
<div class="outline-text-2" id="text-orga9e8f4c">
<p>
So easy to setup LXD!
</p>
</div>
<div id="outline-container-org86bdc9c" class="outline-3">
<h3 id="org86bdc9c">Deb or Snap</h3>
<div class="outline-text-3" id="text-org86bdc9c">
<p>
The existing lxd packages in ubuntu 16.04 are too old to use, which
need to be purged:
</p>
<div class="org-src-container">
<pre class="src src-sh">apt-get -qq purge lxd lxd-client
snap install lxd
</pre>
</div>

<p>
<code>lxd</code> is lxd daemon and <code>lxc</code> is the lxd client:
</p>
<div class="org-src-container">
<pre class="src src-sh">which lxd <span style="color: #73d216;">#</span><span style="color: #73d216;">=&gt;</span>
/snap/bin/lxd
which lxc <span style="color: #73d216;">#</span><span style="color: #73d216;">=&gt;</span>
/snap/bin/lxc
</pre>
</div>
</div>
</div>

<div id="outline-container-org4e171dc" class="outline-3">
<h3 id="org4e171dc">Init</h3>
<div class="outline-text-3" id="text-org4e171dc">
<p>
<code>lxd</code> provides a sub command <code>init</code> to init lxd:
</p>
<div class="org-src-container">
<pre class="src src-sh">lxd init
</pre>
</div>

<p>
<code>lxd init</code> can configure <code>lxd</code> run in clustering mode or standalone
mode.
</p>
</div>
</div>
</div>

<div id="outline-container-orgb2025f0" class="outline-2">
<h2 id="orgb2025f0">Snap and Lxd</h2>
<div class="outline-text-2" id="text-orgb2025f0">
<p>
You can use <code>snap</code> to run <code>lxd</code>, or the opposite. Inside <code>lxd</code> you
can run <code>docker</code>.
</p>

<div class="org-src-container">
<pre class="src src-artist">+----------+       +-----------+       +------------+        +-----------+
|          |       |           |       |            |        |           |
|    vm    +------&gt;|    snap   +------&gt;|     lxd    +-------&gt;|   docker  |
|          |       |           |       |            |        |           |
+----------+       +-----------+       +------+-----+        +-----------+
                         ^                    |
                         |                    |
                         +--------------------+
</pre>
</div>
</div>

<div id="outline-container-orga8f5ead" class="outline-3">
<h3 id="orga8f5ead">Run lxd in Snap</h3>
<div class="outline-text-3" id="text-orga8f5ead">
<p>
By default ubuntu xenial with lxd and lxd client installed. You can
check this by running:
</p>

<div class="org-src-container">
<pre class="src src-sh">which lxd                       <span style="color: #73d216;"># </span><span style="color: #73d216;">=&gt; /usr/bin/lxd</span>
which lxc                       <span style="color: #73d216;"># </span><span style="color: #73d216;">=&gt; /usr/bin/lxc</span>
</pre>
</div>

<p>
The lxd in apt repo is very low. We need to switch to the lxd in
snap store:
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #73d216;"># </span><span style="color: #73d216;">Uninstall existing lxd in ubuntu repo.</span>
apt-get purge -qq lxd lxd-client
<span style="color: #73d216;"># </span><span style="color: #73d216;">Install lxd in snap</span>
snap install lxd
<span style="color: #73d216;"># </span><span style="color: #73d216;">Check lxd and lxc</span>
which lxd                       <span style="color: #73d216;"># </span><span style="color: #73d216;">=&gt; /snap/bin/lxd</span>
lxd --version                   <span style="color: #73d216;"># </span><span style="color: #73d216;">=&gt; 3.3</span>
which lxc                       <span style="color: #73d216;"># </span><span style="color: #73d216;">=&gt; /snap/bin/lxc</span>
lxc --version                   <span style="color: #73d216;"># </span><span style="color: #73d216;">=&gt; 3.3</span>
<span style="color: #73d216;"># </span><span style="color: #73d216;">Init lxd</span>
lxd init
<span style="color: #73d216;"># </span><span style="color: #73d216;">Start lxd</span>
snap restart lxd
</pre>
</div>
</div>
</div>

<div id="outline-container-org7b763fc" class="outline-3">
<h3 id="org7b763fc">Launcn Lxd container</h3>
<div class="outline-text-3" id="text-org7b763fc">
<p>
Now launch a vm like <code>lxc</code> container:
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #73d216;"># </span><span style="color: #73d216;">List images</span>
snap image list ubuntu:xenial
<span style="color: #73d216;"># </span><span style="color: #73d216;">Launch a container</span>
lxc launch ubuntu:xenial/amd64
<span style="color: #73d216;"># </span><span style="color: #73d216;">List containers</span>
lxc list
<span style="color: #73d216;"># </span><span style="color: #73d216;">exec bash in the container</span>
lxc exec steady-dingo bash
<span style="color: #73d216;"># </span><span style="color: #73d216;">Now you can do anything in the container</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd2d6fae" class="outline-3">
<h3 id="orgd2d6fae">Run snap inside Lxd Container</h3>
<div class="outline-text-3" id="text-orgd2d6fae">
<p>
Snap as a container, can run <code>lxd</code> and launch <code>lxd</code>
container. Inside the <code>lxc</code> container, you can run <code>snap</code>
container, say to install go snap:
</p>
<div class="org-src-container">
<pre class="src src-sh">lxc exec steady-dingo bash
snap install go --classic
<span style="color: #e090d7;">echo</span> <span style="color: #e9b96e;">'export GOPATH=/usr/local'</span> &gt;&gt; ~/.bashrc
apt-get install build-essential
cat &gt; ~/.netrc &lt;&lt;EOF
<span style="color: #ffff00; font-weight: bold;">  your github toke  n</span>
<span style="color: #ffff00; font-weight: bold;">EOF</span>
go get github.ibm.com/nanjj/ncatd
ncatd --version                 <span style="color: #73d216;"># </span><span style="color: #73d216;">ncatd version 0.0.1</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgeee63fa" class="outline-3">
<h3 id="orgeee63fa">Run Lxd inside Lxd Container</h3>
<div class="outline-text-3" id="text-orgeee63fa">
<p>
Run <code>lxd</code> inside lxd container nesting:
</p>
<div class="org-src-container">
<pre class="src src-sh">lxc config set steady-dingo security.nesting true
lxc exec steady-dingo bash
apt-get purge -qq lxd lxd-client
snap install lxd
lxd init
lxc launch ubuntu:xenial/amd64
</pre>
</div>
</div>
</div>

<div id="outline-container-org8f0f001" class="outline-3">
<h3 id="org8f0f001">Run Docker inside Lxd Container</h3>
<div class="outline-text-3" id="text-org8f0f001">
<p>
With <code>security.nesting true</code>, run docker:
</p>

<div class="org-src-container">
<pre class="src src-sh">apt-get install docker.io
docker run hello-world
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf423aad" class="outline-3">
<h3 id="orgf423aad">Use Lxd Container as a Router</h3>
<div class="outline-text-3" id="text-orgf423aad">
<div class="org-src-container">
<pre class="src src-sh">lxc launch ubuntu:16.04 router <span style="color: #73d216;">#</span><span style="color: #73d216;">=&gt;</span>
lxc list <span style="color: #73d216;">#</span><span style="color: #73d216;">=&gt;</span>
+--------+---------+-----------------------+------+------------+-----------+
|  NAME  |  STATE  |         IPV4          | IPV6 |    TYPE    | SNAPSHOTS |
+--------+---------+-----------------------+------+------------+-----------+
| router | RUNNING |  10.149.11.203 (eth0) |      | PERSISTENT |           |
+--------+---------+-----------------------+------+------------+-----------+
lxc exec router -- bash -i
<span style="color: #73d216;"># </span><span style="color: #73d216;">configure vpn if needed</span>

<span style="color: #73d216;"># </span><span style="color: #73d216;">check ip forward setting</span>
sysctl net.ipv4.ip_forward <span style="color: #73d216;">#</span><span style="color: #73d216;">=&gt;</span>
net.ipv4.ip_forward = 1
<span style="color: #73d216;"># </span><span style="color: #73d216;">iptables</span>
iptables -t nat -A POSTROUTING -s 10.149.11.0/24 ! -d 10.0.2.0/24 -j MASQUERADE
apt-get update
apt-get install iptables-persistent
</pre>
</div>
<p>
Now you can use this as a router
</p>
</div>
</div>
</div>

<div id="outline-container-org88e8934" class="outline-2">
<h2 id="org88e8934">Clustering Mode</h2>
<div class="outline-text-2" id="text-org88e8934">
<p>
Lxd clustering mode makes lxd run in multiple nodes. Each node lxd
is running on is a cluster member. The whole set of the cluster
members is called a cluster.
</p>
</div>
