lxd.org
** New Cluster
   #+begin_src sh
     lxd init
     Would you like to use LXD clustering? (yes/no) [default=no]: yes
     What name should be used to identify this node in the cluster? [default=hypercube01]:
     What IP address or DNS name should be used to reach this node? [default=192.168.0.46]:
     Are you joining an existing cluster? (yes/no) [default=no]:
     Setup password authentication on the cluster? (yes/no) [default=yes]: yes
     Trust password for new clients:
     Again:
     Do you want to configure a new local storage pool? (yes/no) [default=yes]:
     Name of the storage backend to use (btrfs, dir, lvm, zfs) [default=zfs]:
     Create a new ZFS pool? (yes/no) [default=yes]:
     Would you like to use an existing block device? (yes/no) [default=no]:
     Size in GB of the new loop device (1GB minimum) [default=31GB]: 128GB
     Do you want to configure a new remote storage pool? (yes/no) [default=no]:
     Would you like to connect to a MAAS server? (yes/no) [default=no]:
     Would you like to configure LXD to use an existing bridge or host interface? (yes/no) [default=no]:
     Would you like to create a new Fan overlay network? (yes/no) [default=yes]:
     What subnet should be used as the Fan underlay? [default=auto]:
     Would you like stale cached images to be updated automatically? (yes/no) [default=yes]
     Would you like a YAML "lxd init" preseed to be printed? (yes/no) [default=no]:
   #+end_src
** Join Cluster
   #+begin_src sh
     lxd init
     Would you like to use LXD clustering? (yes/no) [default=no]: yes
     What name should be used to identify this node in the cluster? [default=hypercube06]:
     What IP address or DNS name should be used to reach this node? [default=192.168.0.21]:
     Are you joining an existing cluster? (yes/no) [default=no]: yes
     IP address or FQDN of an existing cluster node: 192.168.0.30
     Cluster fingerprint: 6ab5b519ffbb309cb38b73657299dd9b0b8c6f2bd5b359974bf3bc77ce9c8977
     You can validate this fingerprint by running "lxc info" locally on an existing node.
     Is this the correct fingerprint? (yes/no) [default=no]: yes
     Cluster trust password:
     All existing data is lost when joining a cluster, continue? (yes/no) [default=no] yes
     Choose "size" property for storage pool "local": 128GB
     Choose "source" property for storage pool "local":
     Choose "zfs.pool_name" property for storage pool "local":
     Would you like a YAML "lxd init" preseed to be printed? (yes/no) [default=no]:
   #+end_src
** List Cluster
   #+begin_src sh
     lxc cluster list

     +-------------+---------------------------+----------+--------+-------------------+
     |    NAME     |            URL            | DATABASE | STATE  |      MESSAGE      |
     +-------------+---------------------------+----------+--------+-------------------+
     | hypercube01 | https://192.168.0.46:8443 | YES      | ONLINE | fully operational |
     +-------------+---------------------------+----------+--------+-------------------+
     | hypercube02 | https://192.168.0.47:8443 | YES      | ONLINE | fully operational |
     +-------------+---------------------------+----------+--------+-------------------+
     | hypercube03 | https://192.168.0.48:8443 | YES      | ONLINE | fully operational |
     +-------------+---------------------------+----------+--------+-------------------+
     | hypercube04 | https://192.168.0.51:8443 | NO       | ONLINE | fully operational |
     +-------------+---------------------------+----------+--------+-------------------+
     | hypercube05 | https://192.168.0.30:8443 | NO       | ONLINE | fully operational |
     +-------------+---------------------------+----------+--------+-------------------+
     | hypercube06 | https://192.168.0.21:8443 | NO       | ONLINE | fully operational |
     +-------------+---------------------------+----------+--------+-------------------+
     | hypercube07 | https://192.168.0.26:8443 | NO       | ONLINE | fully operational |
     +-------------+---------------------------+----------+--------+-------------------+
   #+end_src
   It's a 7 nodes lxd cluster with 3 database nodes and 7 service
   nodes.
* Database
  [[https://github.com/lxc/lxd/blob/master/doc/database.md][Lxd database]] is based on [[https://github.com/CanonicalLtd/dqlite][distributed sqlite]], which removed lxd's
  dependency on traditional database like postgres or mysql. [[https://wiki.ubuntu.com/FanNetworking][Fan
  network]] introduced lxd a simple and fast container network.
** Global and Local
   For each lxd node, there are two type databases: global and
   local. Data in global database is shared by each lxd cluster
   members, while data in local database can only be accessed in
   local node, does not impact others.
** Lxd sql
   #+begin_src sh
   lxd sql <local|global> <query>  [flags]
   #+end_src
