lxd.html

<div id="outline-container-orgdd3ac39" class="outline-3">
<h3 id="orgdd3ac39">New Cluster</h3>
<div class="outline-text-3" id="text-orgdd3ac39">
<div class="org-src-container">
<pre class="src src-sh">lxd init
Would you like to use LXD clustering? (yes/no) [<span style="color: #fcaf3e;">default</span>=no]: yes
What name should be used to identify this node<span style="color: #b4fa70;"> in</span> the cluster? [<span style="color: #fcaf3e;">default</span>=hypercube01]:
What IP address or DNS name should be used to reach this node? [<span style="color: #fcaf3e;">default</span>=192.168.0.46]:
Are you joining an existing cluster? (yes/no) [<span style="color: #fcaf3e;">default</span>=no]:
Setup password authentication on the cluster? (yes/no) [<span style="color: #fcaf3e;">default</span>=yes]: yes
Trust password for new clients:
Again:
Do you want to configure a new local storage pool? (yes/no) [<span style="color: #fcaf3e;">default</span>=yes]:
Name of the storage backend to use (btrfs, dir, lvm, zfs) [<span style="color: #fcaf3e;">default</span>=zfs]:
Create a new ZFS pool? (yes/no) [<span style="color: #fcaf3e;">default</span>=yes]:
Would you like to use an existing block device? (yes/no) [<span style="color: #fcaf3e;">default</span>=no]:
Size<span style="color: #b4fa70;"> in</span> GB of the new loop device (1GB minimum) [<span style="color: #fcaf3e;">default</span>=31GB]: 128GB
Do you want to configure a new remote storage pool? (yes/no) [<span style="color: #fcaf3e;">default</span>=no]:
Would you like to connect to a MAAS server? (yes/no) [<span style="color: #fcaf3e;">default</span>=no]:
Would you like to configure LXD to use an existing bridge or host interface? (yes/no) [<span style="color: #fcaf3e;">default</span>=no]:
Would you like to create a new Fan overlay network? (yes/no) [<span style="color: #fcaf3e;">default</span>=yes]:
What subnet should be used as the Fan underlay? [<span style="color: #fcaf3e;">default</span>=auto]:
Would you like stale cached images to be updated automatically? (yes/no) [<span style="color: #fcaf3e;">default</span>=yes]
Would you like a YAML <span style="color: #e9b96e;">"lxd init"</span> preseed to be printed? (yes/no) [<span style="color: #fcaf3e;">default</span>=no]:
</pre>
</div>
</div>
</div>
<div id="outline-container-org1e4a9c7" class="outline-3">
<h3 id="org1e4a9c7">Join Cluster</h3>
<div class="outline-text-3" id="text-org1e4a9c7">
<div class="org-src-container">
<pre class="src src-sh">lxd init
Would you like to use LXD clustering? (yes/no) [<span style="color: #fcaf3e;">default</span>=no]: yes
What name should be used to identify this node<span style="color: #b4fa70;"> in</span> the cluster? [<span style="color: #fcaf3e;">default</span>=hypercube06]:
What IP address or DNS name should be used to reach this node? [<span style="color: #fcaf3e;">default</span>=192.168.0.21]:
Are you joining an existing cluster? (yes/no) [<span style="color: #fcaf3e;">default</span>=no]: yes
IP address or FQDN of an existing cluster node: 192.168.0.30
Cluster fingerprint: 6ab5b519ffbb309cb38b73657299dd9b0b8c6f2bd5b359974bf3bc77ce9c8977
You can validate this fingerprint by running <span style="color: #e9b96e;">"lxc info"</span> locally on an existing node.
Is this the correct fingerprint? (yes/no) [<span style="color: #fcaf3e;">default</span>=no]: yes
Cluster trust password:
All existing data is lost when joining a cluster, continue? (yes/no) [<span style="color: #fcaf3e;">default</span>=no] yes
Choose <span style="color: #e9b96e;">"size"</span> property for storage pool <span style="color: #e9b96e;">"local"</span>: 128GB
Choose <span style="color: #e9b96e;">"source"</span> property for storage pool <span style="color: #e9b96e;">"local"</span>:
Choose <span style="color: #e9b96e;">"zfs.pool_name"</span> property for storage pool <span style="color: #e9b96e;">"local"</span>:
Would you like a YAML <span style="color: #e9b96e;">"lxd init"</span> preseed to be printed? (yes/no) [<span style="color: #fcaf3e;">default</span>=no]:
</pre>
</div>
</div>
</div>
<div id="outline-container-orgbe53a27" class="outline-3">
<h3 id="orgbe53a27">List Cluster</h3>
<div class="outline-text-3" id="text-orgbe53a27">
<div class="org-src-container">
<pre class="src src-sh">lxc cluster list

+-------------+---------------------------+----------+--------+-------------------+
|    NAME     |            URL            | DATABASE | STATE  |      MESSAGE      |
+-------------+---------------------------+----------+--------+-------------------+
| hypercube01 | https://192.168.0.46:8443 | YES      | ONLINE | fully operational |
+-------------+---------------------------+----------+--------+-------------------+
| hypercube02 | https://192.168.0.47:8443 | YES      | ONLINE | fully operational |
+-------------+---------------------------+----------+--------+-------------------+
| hypercube03 | https://192.168.0.48:8443 | YES      | ONLINE | fully operational |
+-------------+---------------------------+----------+--------+-------------------+
| hypercube04 | https://192.168.0.51:8443 | NO       | ONLINE | fully operational |
+-------------+---------------------------+----------+--------+-------------------+
| hypercube05 | https://192.168.0.30:8443 | NO       | ONLINE | fully operational |
+-------------+---------------------------+----------+--------+-------------------+
| hypercube06 | https://192.168.0.21:8443 | NO       | ONLINE | fully operational |
+-------------+---------------------------+----------+--------+-------------------+
| hypercube07 | https://192.168.0.26:8443 | NO       | ONLINE | fully operational |
+-------------+---------------------------+----------+--------+-------------------+
</pre>
</div>
<p>
It's a 7 nodes lxd cluster with 3 database nodes and 7 service
nodes.
</p>
</div>
</div>
</div>
<div id="outline-container-orgba57208" class="outline-2">
<h2 id="orgba57208">Database</h2>
<div class="outline-text-2" id="text-orgba57208">
<p>
<a href="https://github.com/lxc/lxd/blob/master/doc/database.md">Lxd database</a> is based on <a href="https://github.com/CanonicalLtd/dqlite">distributed sqlite</a>, which removed lxd's
dependency on traditional database like postgres or mysql. <a href="https://wiki.ubuntu.com/FanNetworking">Fan
network</a> introduced lxd a simple and fast container network.
</p>
</div>
<div id="outline-container-org410e40c" class="outline-3">
<h3 id="org410e40c">Global and Local</h3>
<div class="outline-text-3" id="text-org410e40c">
<p>
For each lxd node, there are two type databases: global and
local. Data in global database is shared by each lxd cluster
members, while data in local database can only be accessed in
local node, does not impact others.
</p>
</div>
</div>
<div id="outline-container-orgfe40e8d" class="outline-3">
<h3 id="orgfe40e8d">Lxd sql</h3>
<div class="outline-text-3" id="text-orgfe40e8d">
<div class="org-src-container">
<pre class="src src-sh">lxd sql &lt;local|global&gt; &lt;query&gt;  [flags]
</pre>
</div>
</div>
</div>
