lxd.org
** Local Schemas
   To list local database schemas:
   #+begin_src sh
     lxd sql local .schema #=>
     PRAGMA foreign_keys=OFF;
     BEGIN TRANSACTION;
     CREATE TABLE schema (
         id         INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL,
         version    INTEGER NOT NULL,
         updated_at DATETIME NOT NULL,
         UNIQUE (version)
     );
     INSERT INTO schema VALUES(1,38,1546788240);
     CREATE TABLE config (
         id INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL,
         key VARCHAR(255) NOT NULL,
         value TEXT,
         UNIQUE (key)
     );
     CREATE TABLE patches (
         id INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL,
         name VARCHAR(255) NOT NULL,
         applied_at DATETIME NOT NULL,
         UNIQUE (name)
     );
     CREATE TABLE raft_nodes (
         id INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL,
         address TEXT NOT NULL,
         UNIQUE (address)
     );
     COMMIT;
   #+end_src
** Raft Nodes
   #+begin_src sh
     lxd sql local 'select * from raft_nodes' #=>
     +----+-------------------+
     | id |      address      |
     +----+-------------------+
     | 1  | 192.168.0.46:8443 |
     | 2  | 192.168.0.47:8443 |
     | 3  | 192.168.0.48:8443 |
     +----+-------------------+
   #+end_src
   [[https://github.com/CanonicalLtd/dqlite][Distributed Sqlite]] is using raft to sync sqlite db logs.
** Cluster nodes
   #+begin_src sh
     lxd sql global 'select * from nodes'
     +----+-------------+-------------------+--------+----------------+--------------------------------+---------+
     | id |    name     |      address      | schema | api_extensions |           heartbeat            | pending |
     +----+-------------+-------------------+--------+----------------+--------------------------------+---------+
     | 1  | hypercube01 | 192.168.0.46:8443 | 13     | 115            | 2019-01-29T12:09:42.37271017Z  | 0       |
     | 2  | hypercube02 | 192.168.0.47:8443 | 13     | 115            | 2019-01-29T12:09:42.45776374Z  | 0       |
     | 3  | hypercube03 | 192.168.0.48:8443 | 13     | 115            | 2019-01-29T12:09:42.521913386Z | 0       |
     | 4  | hypercube04 | 192.168.0.51:8443 | 13     | 115            | 2019-01-29T12:09:42.599993638Z | 0       |
     | 5  | hypercube05 | 192.168.0.30:8443 | 13     | 115            | 2019-01-29T12:09:42.661997234Z | 0       |
     | 6  | hypercube06 | 192.168.0.21:8443 | 13     | 115            | 2019-01-29T12:09:42.733539797Z | 0       |
     | 7  | hypercube07 | 192.168.0.26:8443 | 13     | 115            | 2019-01-29T12:09:42.796405819Z | 0       |
     +----+-------------+-------------------+--------+----------------+--------------------------------+---------+
   #+end_src
** Containers
   #+begin_src sh
     lxd sql global 'select * from containers' #=>
     +----+---------+----------------+------------+
     | id | node_id |      name      | project_id |
     +----+---------+----------------+------------+
     | 20 | 2       | grafana        | 1          |
     | 30 | 3       | go             | 1          |
     | 32 | 1       | guyujie        | 1          |
     | 33 | 4       | nginx          | 1          |
     | 36 | 1       | lxdui01        | 1          |
     | 38 | 1       | crack-mako     | 1          |
     | 39 | 5       | lxdui02        | 1          |
     | 42 | 6       | fluent-hamster | 1          |
     | 43 | 1       | b2             | 1          |
     | 44 | 2       | b3             | 1          |
     +----+---------+----------------+------------+
   #+end_src
   To select the node with least containers:
   #+begin_src sh
     lxd sql global \
         'select node_id, count(node_id) as node_count from containers
          group by node_id order by node_count'
   #+end_src
* Network

  Lxd can be configured to use [[https://wiki.ubuntu.com/FanNetworking][Ubuntu Fan Network]].

  Say 2 containers A and B:
  | Container | IP            | Hyper       | Hyper IP        |
  |-----------+---------------+-------------+-----------------|
  | A         | 240.0.46.14/8 | hypercube01 | 192.168.0.46/16 |
  | B         | 240.0.47.99/8 | hypercube02 | 192.168.0.47/16 |

  Now ping B on A:
  #+begin_src sh
  ping 240.0.47.99 #=>
  ARP, Request who-has 240.0.47.99 tell 240.0.46.14, length 28
  #+end_src
  On hypercube01 the arp request being forwarded to hypercube02:
  #+begin_src sh
    17:07:29.650323 IP 192.168.0.46.53730 > 192.168.0.47.8472
    ARP, Request who-has 240.0.47.99 tell 240.0.46.14, length 28
  #+end_src
* Operations
