lxd.html
<div id="outline-container-org44dd87e" class="outline-3">
<h3 id="org44dd87e">Local Schemas</h3>
<div class="outline-text-3" id="text-org44dd87e">
<p>
To list local database schemas:
</p>
<div class="org-src-container">
<pre class="src src-sh">lxd sql local .schema <span style="color: #73d216;">#</span><span style="color: #73d216;">=&gt;</span>
PRAGMA <span style="color: #fcaf3e;">foreign_keys</span>=OFF;
BEGIN TRANSACTION;
CREATE TABLE schema (
    id         INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL,
    version    INTEGER NOT NULL,
    updated_at DATETIME NOT NULL,
    UNIQUE (version)
);
INSERT INTO schema VALUES(1,38,1546788240);
CREATE TABLE config (
    id INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL,
    key VARCHAR(255) NOT NULL,
    value TEXT,
    UNIQUE (key)
);
CREATE TABLE patches (
    id INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL,
    name VARCHAR(255) NOT NULL,
    applied_at DATETIME NOT NULL,
    UNIQUE (name)
);
CREATE TABLE raft_nodes (
    id INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL,
    address TEXT NOT NULL,
    UNIQUE (address)
);
COMMIT;
</pre>
</div>
</div>
</div>
<div id="outline-container-orgdbc4f2f" class="outline-3">
<h3 id="orgdbc4f2f">Raft Nodes</h3>
<div class="outline-text-3" id="text-orgdbc4f2f">
<div class="org-src-container">
<pre class="src src-sh">lxd sql local <span style="color: #e9b96e;">'select * from raft_nodes'</span> <span style="color: #73d216;">#</span><span style="color: #73d216;">=&gt;</span>
+----+-------------------+
| id |      address      |
+----+-------------------+
| 1  | 192.168.0.46:8443 |
| 2  | 192.168.0.47:8443 |
| 3  | 192.168.0.48:8443 |
+----+-------------------+
</pre>
</div>
<p>
<a href="https://github.com/CanonicalLtd/dqlite">Distributed Sqlite</a> is using raft to sync sqlite db logs.
</p>
</div>
</div>
<div id="outline-container-orgebc5da4" class="outline-3">
<h3 id="orgebc5da4">Cluster nodes</h3>
<div class="outline-text-3" id="text-orgebc5da4">
<div class="org-src-container">
<pre class="src src-sh">lxd sql global <span style="color: #e9b96e;">'select * from nodes'</span>
+----+-------------+-------------------+--------+----------------+--------------------------------+---------+
| id |    name     |      address      | schema | api_extensions |           heartbeat            | pending |
+----+-------------+-------------------+--------+----------------+--------------------------------+---------+
| 1  | hypercube01 | 192.168.0.46:8443 | 13     | 115            | 2019-01-29T12:09:42.37271017Z  | 0       |
| 2  | hypercube02 | 192.168.0.47:8443 | 13     | 115            | 2019-01-29T12:09:42.45776374Z  | 0       |
| 3  | hypercube03 | 192.168.0.48:8443 | 13     | 115            | 2019-01-29T12:09:42.521913386Z | 0       |
| 4  | hypercube04 | 192.168.0.51:8443 | 13     | 115            | 2019-01-29T12:09:42.599993638Z | 0       |
| 5  | hypercube05 | 192.168.0.30:8443 | 13     | 115            | 2019-01-29T12:09:42.661997234Z | 0       |
| 6  | hypercube06 | 192.168.0.21:8443 | 13     | 115            | 2019-01-29T12:09:42.733539797Z | 0       |
| 7  | hypercube07 | 192.168.0.26:8443 | 13     | 115            | 2019-01-29T12:09:42.796405819Z | 0       |
+----+-------------+-------------------+--------+----------------+--------------------------------+---------+
</pre>
</div>
</div>
</div>
<div id="outline-container-orge148896" class="outline-3">
<h3 id="orge148896">Containers</h3>
<div class="outline-text-3" id="text-orge148896">
<div class="org-src-container">
<pre class="src src-sh">lxd sql global <span style="color: #e9b96e;">'select * from containers'</span> <span style="color: #73d216;">#</span><span style="color: #73d216;">=&gt;</span>
+----+---------+----------------+------------+
| id | node_id |      name      | project_id |
+----+---------+----------------+------------+
| 20 | 2       | grafana        | 1          |
| 30 | 3       | go             | 1          |
| 32 | 1       | guyujie        | 1          |
| 33 | 4       | nginx          | 1          |
| 36 | 1       | lxdui01        | 1          |
| 38 | 1       | crack-mako     | 1          |
| 39 | 5       | lxdui02        | 1          |
| 42 | 6       | fluent-hamster | 1          |
| 43 | 1       | b2             | 1          |
| 44 | 2       | b3             | 1          |
+----+---------+----------------+------------+
</pre>
</div>
<p>
To select the node with least containers:
</p>
<div class="org-src-container">
<pre class="src src-sh">lxd sql global <span style="color: #e9b96e;">\</span>
    <span style="color: #e9b96e;">'select node_id, count(node_id) as node_count from containers</span>
<span style="color: #e9b96e;">     group by node_id order by node_count'</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org1f98b03" class="outline-2">
<h2 id="org1f98b03">Network</h2>
<div class="outline-text-2" id="text-org1f98b03">
<p>
Lxd can be configured to use <a href="https://wiki.ubuntu.com/FanNetworking">Ubuntu Fan Network</a>.
</p>

<p>
Say 2 containers A and B:
</p>
<table>


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Container</th>
<th scope="col" class="org-left">IP</th>
<th scope="col" class="org-left">Hyper</th>
<th scope="col" class="org-left">Hyper IP</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">A</td>
<td class="org-left">240.0.46.14/8</td>
<td class="org-left">hypercube01</td>
<td class="org-left">192.168.0.46/16</td>
</tr>

<tr>
<td class="org-left">B</td>
<td class="org-left">240.0.47.99/8</td>
<td class="org-left">hypercube02</td>
<td class="org-left">192.168.0.47/16</td>
</tr>
</tbody>
</table>

<p>
Now ping B on A:
</p>
<div class="org-src-container">
<pre class="src src-sh">ping 240.0.47.99 <span style="color: #73d216;">#</span><span style="color: #73d216;">=&gt;</span>
ARP, Request who-has 240.0.47.99 tell 240.0.46.14, length 28
</pre>
</div>
<p>
On hypercube01 the arp request being forwarded to hypercube02:
</p>
<div class="org-src-container">
<pre class="src src-sh">17:07:29.650323 IP 192.168.0.46.53730 &gt; 192.168.0.47.8472
ARP, Request who-has 240.0.47.99 tell 240.0.46.14, length 28
</pre>
</div>
</div>
</div>
