lxd.html
<div id="outline-container-orgf60ba93" class="outline-2">
<h2 id="orgf60ba93">Operations</h2>
<div class="outline-text-2" id="text-orgf60ba93">
</div>
<div id="outline-container-org825cfd6" class="outline-3">
<h3 id="org825cfd6">Launch Container</h3>
<div class="outline-text-3" id="text-org825cfd6">
<p>
<code>lxc launch b --debug</code> will do:
</p>
<ol class="org-ol">
<li><p>
Get version
</p>
<div class="org-src-container">
<pre class="src src-sh">DBUG[01-22|14:13:15] Connecting to a remote LXD over HTTPs
DBUG[01-22|14:13:15] Sending request to LXD                   <span style="color: #fcaf3e;">method</span>=GET <span style="color: #fcaf3e;">url</span>=https://192.168.0.48:8443/1.0 <span style="color: #fcaf3e;">etag</span>=
DBUG[01-22|14:13:17] Got response struct from LXD
DBUG[01-22|14:13:17]
        {
                <span style="color: #e9b96e;">"config"</span>: {
                        <span style="color: #e9b96e;">"cluster.https_address"</span>: <span style="color: #e9b96e;">"192.168.0.48:8443"</span>,
                        <span style="color: #e9b96e;">"core.https_address"</span>: <span style="color: #e9b96e;">"192.168.0.48:8443"</span>,
                        <span style="color: #e9b96e;">"core.trust_password"</span>: true
                },
                <span style="color: #e9b96e;">"api_extensions"</span>: [...],
                <span style="color: #e9b96e;">"api_status"</span>: <span style="color: #e9b96e;">"stable"</span>,
                <span style="color: #e9b96e;">"api_version"</span>: <span style="color: #e9b96e;">"1.0"</span>,
                <span style="color: #e9b96e;">"auth"</span>: <span style="color: #e9b96e;">"trusted"</span>,
                <span style="color: #e9b96e;">"public"</span>: false,
                <span style="color: #e9b96e;">"auth_methods"</span>: [
                        <span style="color: #e9b96e;">"tls"</span>
                ],
                <span style="color: #e9b96e;">"environment"</span>: {
                        <span style="color: #e9b96e;">"addresses"</span>: [
                                <span style="color: #e9b96e;">"192.168.0.48:8443"</span>
                        ],
                        <span style="color: #e9b96e;">"architectures"</span>: [
                                <span style="color: #e9b96e;">"x86_64"</span>,
                                <span style="color: #e9b96e;">"i686"</span>
                        ],
                        <span style="color: #e9b96e;">"certificate"</span>: <span style="color: #e9b96e;">"..."</span>,
                        <span style="color: #e9b96e;">"certificate_fingerprint"</span>: <span style="color: #e9b96e;">"..."</span>,
                        <span style="color: #e9b96e;">"driver"</span>: <span style="color: #e9b96e;">"lxc"</span>,
                        <span style="color: #e9b96e;">"driver_version"</span>: <span style="color: #e9b96e;">"3.1.0"</span>,
                        <span style="color: #e9b96e;">"kernel"</span>: <span style="color: #e9b96e;">"Linux"</span>,
                        <span style="color: #e9b96e;">"kernel_architecture"</span>: <span style="color: #e9b96e;">"x86_64"</span>,
                        <span style="color: #e9b96e;">"kernel_version"</span>: <span style="color: #e9b96e;">"4.15.0-43-generic"</span>,
                        <span style="color: #e9b96e;">"server"</span>: <span style="color: #e9b96e;">"lxd"</span>,
                        <span style="color: #e9b96e;">"server_pid"</span>: 32645,
                        <span style="color: #e9b96e;">"server_version"</span>: <span style="color: #e9b96e;">"3.9"</span>,
                        <span style="color: #e9b96e;">"storage"</span>: <span style="color: #e9b96e;">"zfs"</span>,
                        <span style="color: #e9b96e;">"storage_version"</span>: <span style="color: #e9b96e;">"0.7.5-1ubuntu16.4"</span>,
                        <span style="color: #e9b96e;">"server_clustered"</span>: true,
                        <span style="color: #e9b96e;">"server_name"</span>: <span style="color: #e9b96e;">"hypercube03"</span>,
                        <span style="color: #e9b96e;">"project"</span>: <span style="color: #e9b96e;">"default"</span>
                }
        }
</pre>
</div></li>
<li><p>
Get image
</p>
<div class="org-src-container">
<pre class="src src-sh">Creating the container
DBUG[01-22|14:13:17] Sending request to LXD                   <span style="color: #fcaf3e;">method</span>=GET <span style="color: #fcaf3e;">url</span>=https://192.168.0.48:8443/1.0/images/aliases/b <span style="color: #fcaf3e;">etag</span>=
DBUG[01-22|14:13:19] Got response struct from LXD
DBUG[01-22|14:13:19]
        {
                <span style="color: #e9b96e;">"description"</span>: <span style="color: #e9b96e;">""</span>,
                <span style="color: #e9b96e;">"target"</span>: <span style="color: #e9b96e;">"dcbc8e3e5c2ed9fb21c3d0659a0eee004bde52fac6616bc1453717032e52a700"</span>,
                <span style="color: #e9b96e;">"name"</span>: <span style="color: #e9b96e;">"b"</span>
        }
DBUG[01-22|14:13:19] Sending request to LXD                   <span style="color: #fcaf3e;">method</span>=GET <span style="color: #fcaf3e;">url</span>=https://192.168.0.48:8443/1.0/images/dcbc8e3e5c2ed9fb21c3d0659a0eee004bde52fac6616bc1453717032e52a700 <span style="color: #fcaf3e;">etag</span>=
DBUG[01-22|14:13:20] Got response struct from LXD
DBUG[01-22|14:13:20]
        {
                <span style="color: #e9b96e;">"auto_update"</span>: true,
                <span style="color: #e9b96e;">"properties"</span>: {
                        <span style="color: #e9b96e;">"architecture"</span>: <span style="color: #e9b96e;">"amd64"</span>,
                        <span style="color: #e9b96e;">"description"</span>: <span style="color: #e9b96e;">"ubuntu 18.04 LTS amd64 (release) (20190114)"</span>,
                        <span style="color: #e9b96e;">"label"</span>: <span style="color: #e9b96e;">"release"</span>,
                        <span style="color: #e9b96e;">"os"</span>: <span style="color: #e9b96e;">"ubuntu"</span>,
                        <span style="color: #e9b96e;">"release"</span>: <span style="color: #e9b96e;">"bionic"</span>,
                        <span style="color: #e9b96e;">"serial"</span>: <span style="color: #e9b96e;">"20190114"</span>,
                        <span style="color: #e9b96e;">"version"</span>: <span style="color: #e9b96e;">"18.04"</span>
                },
                <span style="color: #e9b96e;">"public"</span>: false,
                <span style="color: #e9b96e;">"aliases"</span>: [
                        {
                                <span style="color: #e9b96e;">"name"</span>: <span style="color: #e9b96e;">"b"</span>,
                                <span style="color: #e9b96e;">"description"</span>: <span style="color: #e9b96e;">""</span>
                        }
                ],
                <span style="color: #e9b96e;">"architecture"</span>: <span style="color: #e9b96e;">"x86_64"</span>,
                <span style="color: #e9b96e;">"cached"</span>: true,
                <span style="color: #e9b96e;">"filename"</span>: <span style="color: #e9b96e;">"ubuntu-18.04-server-cloudimg-amd64-lxd.tar.xz"</span>,
                <span style="color: #e9b96e;">"fingerprint"</span>: <span style="color: #e9b96e;">"dcbc8e3e5c2ed9fb21c3d0659a0eee004bde52fac6616bc1453717032e52a700"</span>,
                <span style="color: #e9b96e;">"size"</span>: 183468820,
                <span style="color: #e9b96e;">"update_source"</span>: {
                        <span style="color: #e9b96e;">"alias"</span>: <span style="color: #e9b96e;">"b"</span>,
                        <span style="color: #e9b96e;">"certificate"</span>: <span style="color: #e9b96e;">""</span>,
                        <span style="color: #e9b96e;">"protocol"</span>: <span style="color: #e9b96e;">"simplestreams"</span>,
                        <span style="color: #e9b96e;">"server"</span>: <span style="color: #e9b96e;">"https://cloud-images.ubuntu.com/releases"</span>
                },
                <span style="color: #e9b96e;">"created_at"</span>: <span style="color: #e9b96e;">"2019-01-14T00:00:00Z"</span>,
                <span style="color: #e9b96e;">"expires_at"</span>: <span style="color: #e9b96e;">"2023-04-26T00:00:00Z"</span>,
                <span style="color: #e9b96e;">"last_used_at"</span>: <span style="color: #e9b96e;">"2019-01-18T08:22:28.5476208Z"</span>,
                <span style="color: #e9b96e;">"uploaded_at"</span>: <span style="color: #e9b96e;">"2019-01-15T00:36:47.651093161Z"</span>
        }
</pre>
</div></li>
<li><p>
Create Container Operation
</p>
<div class="org-src-container">
<pre class="src src-sh">DBUG[01-22|14:13:22] Connected to the websocket
DBUG[01-22|14:13:22] Sending request to LXD                   <span style="color: #fcaf3e;">method</span>=POST <span style="color: #fcaf3e;">url</span>=https://192.168.0.48:8443/1.0/containers <span style="color: #fcaf3e;">etag</span>=
DBUG[01-22|14:13:22]
        {
                <span style="color: #e9b96e;">"architecture"</span>: <span style="color: #e9b96e;">""</span>,
                <span style="color: #e9b96e;">"config"</span>: {},
                <span style="color: #e9b96e;">"devices"</span>: {},
                <span style="color: #e9b96e;">"ephemeral"</span>: false,
                <span style="color: #e9b96e;">"profiles"</span>: null,
                <span style="color: #e9b96e;">"stateful"</span>: false,
                <span style="color: #e9b96e;">"description"</span>: <span style="color: #e9b96e;">""</span>,
                <span style="color: #e9b96e;">"name"</span>: <span style="color: #e9b96e;">""</span>,
                <span style="color: #e9b96e;">"source"</span>: {
                        <span style="color: #e9b96e;">"type"</span>: <span style="color: #e9b96e;">"image"</span>,
                        <span style="color: #e9b96e;">"certificate"</span>: <span style="color: #e9b96e;">""</span>,
                        <span style="color: #e9b96e;">"fingerprint"</span>: <span style="color: #e9b96e;">"dcbc8e3e5c2ed9fb21c3d0659a0eee004bde52fac6616bc1453717032e52a700"</span>
                },
                <span style="color: #e9b96e;">"instance_type"</span>: <span style="color: #e9b96e;">""</span>
        }
DBUG[01-22|14:13:24] Got operation from LXD
DBUG[01-22|14:13:24]
        {
                <span style="color: #e9b96e;">"id"</span>: <span style="color: #e9b96e;">"1de45646-d209-413f-827a-ef7921c3c7f8"</span>,
                <span style="color: #e9b96e;">"class"</span>: <span style="color: #e9b96e;">"task"</span>,
                <span style="color: #e9b96e;">"description"</span>: <span style="color: #e9b96e;">"Creating container"</span>,
                <span style="color: #e9b96e;">"created_at"</span>: <span style="color: #e9b96e;">"2019-01-22T06:13:23.360302136Z"</span>,
                <span style="color: #e9b96e;">"updated_at"</span>: <span style="color: #e9b96e;">"2019-01-22T06:13:23.360302136Z"</span>,
                <span style="color: #e9b96e;">"status"</span>: <span style="color: #e9b96e;">"Running"</span>,
                <span style="color: #e9b96e;">"status_code"</span>: 103,
                <span style="color: #e9b96e;">"resources"</span>: {
                        <span style="color: #e9b96e;">"containers"</span>: [
                                <span style="color: #e9b96e;">"/1.0/containers/fluent-hamster"</span>
                        ]
                },
                <span style="color: #e9b96e;">"metadata"</span>: null,
                <span style="color: #e9b96e;">"may_cancel"</span>: false,
                <span style="color: #e9b96e;">"err"</span>: <span style="color: #e9b96e;">""</span>
        }
</pre>
</div></li>
<li><p>
Wait Create Operation Done
</p>
<div class="org-src-container">
<pre class="src src-sh">DBUG[01-22|14:13:24] Sending request to LXD                   <span style="color: #fcaf3e;">method</span>=GET <span style="color: #fcaf3e;">url</span>=https://192.168.0.48:8443/1.0/operations/1de45646-d209-413f-827a-ef7921c3c7f8 <span style="color: #fcaf3e;">etag</span>=
DBUG[01-22|14:13:25] Got response struct from LXD
DBUG[01-22|14:13:25]
        {
                <span style="color: #e9b96e;">"id"</span>: <span style="color: #e9b96e;">"1de45646-d209-413f-827a-ef7921c3c7f8"</span>,
                <span style="color: #e9b96e;">"class"</span>: <span style="color: #e9b96e;">"task"</span>,
                <span style="color: #e9b96e;">"description"</span>: <span style="color: #e9b96e;">"Creating container"</span>,
                <span style="color: #e9b96e;">"created_at"</span>: <span style="color: #e9b96e;">"2019-01-22T06:13:23.360302136Z"</span>,
                <span style="color: #e9b96e;">"updated_at"</span>: <span style="color: #e9b96e;">"2019-01-22T06:13:23.360302136Z"</span>,
                <span style="color: #e9b96e;">"status"</span>: <span style="color: #e9b96e;">"Running"</span>,
                <span style="color: #e9b96e;">"status_code"</span>: 103,
                <span style="color: #e9b96e;">"resources"</span>: {
                        <span style="color: #e9b96e;">"containers"</span>: [
                                <span style="color: #e9b96e;">"/1.0/containers/fluent-hamster"</span>
                        ]
                },
                <span style="color: #e9b96e;">"metadata"</span>: null,
                <span style="color: #e9b96e;">"may_cancel"</span>: false,
                <span style="color: #e9b96e;">"err"</span>: <span style="color: #e9b96e;">""</span>
        }
Container name is: fluent-hamster
</pre>
</div></li>
<li><p>
Get container
</p>
<div class="org-src-container">
<pre class="src src-sh">DBUG[01-22|14:13:37] Sending request to LXD                   <span style="color: #fcaf3e;">method</span>=GET <span style="color: #fcaf3e;">url</span>=https://192.168.0.48:8443/1.0/containers/fluent-hamster <span style="color: #fcaf3e;">etag</span>=
DBUG[01-22|14:13:39] Got response struct from LXD
DBUG[01-22|14:13:39]
        {
                <span style="color: #e9b96e;">"architecture"</span>: <span style="color: #e9b96e;">"x86_64"</span>,
                <span style="color: #e9b96e;">"config"</span>: {
                        <span style="color: #e9b96e;">"image.architecture"</span>: <span style="color: #e9b96e;">"amd64"</span>,
                        <span style="color: #e9b96e;">"image.description"</span>: <span style="color: #e9b96e;">"ubuntu 18.04 LTS amd64 (release) (20190114)"</span>,
                        <span style="color: #e9b96e;">"image.label"</span>: <span style="color: #e9b96e;">"release"</span>,
                        <span style="color: #e9b96e;">"image.os"</span>: <span style="color: #e9b96e;">"ubuntu"</span>,
                        <span style="color: #e9b96e;">"image.release"</span>: <span style="color: #e9b96e;">"bionic"</span>,
                        <span style="color: #e9b96e;">"image.serial"</span>: <span style="color: #e9b96e;">"20190114"</span>,
                        <span style="color: #e9b96e;">"image.version"</span>: <span style="color: #e9b96e;">"18.04"</span>,
                        <span style="color: #e9b96e;">"volatile.apply_template"</span>: <span style="color: #e9b96e;">"create"</span>,
                        <span style="color: #e9b96e;">"volatile.base_image"</span>: <span style="color: #e9b96e;">"dcbc8e3e5c2ed9fb21c3d0659a0eee004bde52fac6616bc1453717032e52a700"</span>,
                        <span style="color: #e9b96e;">"volatile.eth0.hwaddr"</span>: <span style="color: #e9b96e;">"00:16:3e:e3:bf:17"</span>,
                        <span style="color: #e9b96e;">"volatile.idmap.base"</span>: <span style="color: #e9b96e;">"0"</span>,
                        <span style="color: #e9b96e;">"volatile.idmap.next"</span>: <span style="color: #e9b96e;">"[{\"Isuid\":true,\"Isgid\":true,\"Hostid\":1000000,\"Nsid\":0,\"Maprange\":1000000000}]"</span>,
                        <span style="color: #e9b96e;">"volatile.last_state.idmap"</span>: <span style="color: #e9b96e;">"[{\"Isuid\":true,\"Isgid\":true,\"Hostid\":1000000,\"Nsid\":0,\"Maprange\":1000000000}]"</span>
                },
                <span style="color: #e9b96e;">"devices"</span>: {},
                <span style="color: #e9b96e;">"ephemeral"</span>: false,
                <span style="color: #e9b96e;">"profiles"</span>: [
                        <span style="color: #e9b96e;">"default"</span>
                ],
                <span style="color: #e9b96e;">"stateful"</span>: false,
                <span style="color: #e9b96e;">"description"</span>: <span style="color: #e9b96e;">""</span>,
                <span style="color: #e9b96e;">"created_at"</span>: <span style="color: #e9b96e;">"2019-01-22T06:13:29.053538619Z"</span>,
                <span style="color: #e9b96e;">"expanded_config"</span>: {
                        <span style="color: #e9b96e;">"image.architecture"</span>: <span style="color: #e9b96e;">"amd64"</span>,
                        <span style="color: #e9b96e;">"image.description"</span>: <span style="color: #e9b96e;">"ubuntu 18.04 LTS amd64 (release) (20190114)"</span>,
                        <span style="color: #e9b96e;">"image.label"</span>: <span style="color: #e9b96e;">"release"</span>,
                        <span style="color: #e9b96e;">"image.os"</span>: <span style="color: #e9b96e;">"ubuntu"</span>,
                        <span style="color: #e9b96e;">"image.release"</span>: <span style="color: #e9b96e;">"bionic"</span>,
                        <span style="color: #e9b96e;">"image.serial"</span>: <span style="color: #e9b96e;">"20190114"</span>,
                        <span style="color: #e9b96e;">"image.version"</span>: <span style="color: #e9b96e;">"18.04"</span>,
                        <span style="color: #e9b96e;">"volatile.apply_template"</span>: <span style="color: #e9b96e;">"create"</span>,
                        <span style="color: #e9b96e;">"volatile.base_image"</span>: <span style="color: #e9b96e;">"dcbc8e3e5c2ed9fb21c3d0659a0eee004bde52fac6616bc1453717032e52a700"</span>,
                        <span style="color: #e9b96e;">"volatile.eth0.hwaddr"</span>: <span style="color: #e9b96e;">"00:16:3e:e3:bf:17"</span>,
                        <span style="color: #e9b96e;">"volatile.idmap.base"</span>: <span style="color: #e9b96e;">"0"</span>,
                        <span style="color: #e9b96e;">"volatile.idmap.next"</span>: <span style="color: #e9b96e;">"[{\"Isuid\":true,\"Isgid\":true,\"Hostid\":1000000,\"Nsid\":0,\"Maprange\":1000000000}]"</span>,
                        <span style="color: #e9b96e;">"volatile.last_state.idmap"</span>: <span style="color: #e9b96e;">"[{\"Isuid\":true,\"Isgid\":true,\"Hostid\":1000000,\"Nsid\":0,\"Maprange\":1000000000}]"</span>
                },
                <span style="color: #e9b96e;">"expanded_devices"</span>: {
                        <span style="color: #e9b96e;">"eth0"</span>: {
                                <span style="color: #e9b96e;">"name"</span>: <span style="color: #e9b96e;">"eth0"</span>,
                                <span style="color: #e9b96e;">"nictype"</span>: <span style="color: #e9b96e;">"bridged"</span>,
                                <span style="color: #e9b96e;">"parent"</span>: <span style="color: #e9b96e;">"lxdfan0"</span>,
                                <span style="color: #e9b96e;">"type"</span>: <span style="color: #e9b96e;">"nic"</span>
                        },
                        <span style="color: #e9b96e;">"root"</span>: {
                                <span style="color: #e9b96e;">"path"</span>: <span style="color: #e9b96e;">"/"</span>,
                                <span style="color: #e9b96e;">"pool"</span>: <span style="color: #e9b96e;">"local"</span>,
                                <span style="color: #e9b96e;">"type"</span>: <span style="color: #e9b96e;">"disk"</span>
                        }
                },
                <span style="color: #e9b96e;">"name"</span>: <span style="color: #e9b96e;">"fluent-hamster"</span>,
                <span style="color: #e9b96e;">"status"</span>: <span style="color: #e9b96e;">"Stopped"</span>,
                <span style="color: #e9b96e;">"status_code"</span>: 102,
                <span style="color: #e9b96e;">"last_used_at"</span>: <span style="color: #e9b96e;">"1970-01-01T00:00:00Z"</span>,
                <span style="color: #e9b96e;">"location"</span>: <span style="color: #e9b96e;">"hypercube06"</span>
        }
</pre>
</div></li>
<li><p>
Start Container Operation
</p>
<div class="org-src-container">
<pre class="src src-sh">Starting fluent-hamster
DBUG[01-22|14:13:39] Sending request to LXD                   <span style="color: #fcaf3e;">method</span>=PUT <span style="color: #fcaf3e;">url</span>=https://192.168.0.48:8443/1.0/containers/fluent-hamster/state <span style="color: #fcaf3e;">etag</span>=
DBUG[01-22|14:13:39]
        {
                <span style="color: #e9b96e;">"action"</span>: <span style="color: #e9b96e;">"start"</span>,
                <span style="color: #e9b96e;">"timeout"</span>: -1,
                <span style="color: #e9b96e;">"force"</span>: false,
                <span style="color: #e9b96e;">"stateful"</span>: false
        }
DBUG[01-22|14:13:40] Got operation from LXD
DBUG[01-22|14:13:40]
        {
                <span style="color: #e9b96e;">"id"</span>: <span style="color: #e9b96e;">"46746a23-5873-4755-a0ad-27385370aa39"</span>,
                <span style="color: #e9b96e;">"class"</span>: <span style="color: #e9b96e;">"task"</span>,
                <span style="color: #e9b96e;">"description"</span>: <span style="color: #e9b96e;">"Starting container"</span>,
                <span style="color: #e9b96e;">"created_at"</span>: <span style="color: #e9b96e;">"2019-01-22T06:13:40.232324373Z"</span>,
                <span style="color: #e9b96e;">"updated_at"</span>: <span style="color: #e9b96e;">"2019-01-22T06:13:40.232324373Z"</span>,
                <span style="color: #e9b96e;">"status"</span>: <span style="color: #e9b96e;">"Running"</span>,
                <span style="color: #e9b96e;">"status_code"</span>: 103,
                <span style="color: #e9b96e;">"resources"</span>: {
                        <span style="color: #e9b96e;">"containers"</span>: [
                                <span style="color: #e9b96e;">"/1.0/containers/fluent-hamster"</span>
                        ]
                },
                <span style="color: #e9b96e;">"metadata"</span>: null,
                <span style="color: #e9b96e;">"may_cancel"</span>: false,
                <span style="color: #e9b96e;">"err"</span>: <span style="color: #e9b96e;">""</span>
        }
</pre>
</div></li>
<li><p>
Wait Start Operation Done
</p>
<div class="org-src-container">
<pre class="src src-sh">DBUG[01-22|14:13:40] Sending request to LXD                   <span style="color: #fcaf3e;">method</span>=GET <span style="color: #fcaf3e;">url</span>=https://192.168.0.48:8443/1.0/operations/46746a23-5873-4755-a0ad-27385370aa39 <span style="color: #fcaf3e;">etag</span>=
DBUG[01-22|14:13:42] Got response struct from LXD
DBUG[01-22|14:13:42]
        {
                <span style="color: #e9b96e;">"id"</span>: <span style="color: #e9b96e;">"46746a23-5873-4755-a0ad-27385370aa39"</span>,
                <span style="color: #e9b96e;">"class"</span>: <span style="color: #e9b96e;">"task"</span>,
                <span style="color: #e9b96e;">"description"</span>: <span style="color: #e9b96e;">"Starting container"</span>,
                <span style="color: #e9b96e;">"created_at"</span>: <span style="color: #e9b96e;">"2019-01-22T06:13:40.232324373Z"</span>,
                <span style="color: #e9b96e;">"updated_at"</span>: <span style="color: #e9b96e;">"2019-01-22T06:13:40.232324373Z"</span>,
                <span style="color: #e9b96e;">"status"</span>: <span style="color: #e9b96e;">"Success"</span>,
                <span style="color: #e9b96e;">"status_code"</span>: 200,
                <span style="color: #e9b96e;">"resources"</span>: {
                        <span style="color: #e9b96e;">"containers"</span>: [
                                <span style="color: #e9b96e;">"/1.0/containers/fluent-hamster"</span>
                        ]
                },
                <span style="color: #e9b96e;">"metadata"</span>: null,
                <span style="color: #e9b96e;">"may_cancel"</span>: false,
                <span style="color: #e9b96e;">"err"</span>: <span style="color: #e9b96e;">""</span>
        }
</pre>
</div></li>
</ol>
</div>
</div>
</div>
