lxd.org
* Ansible
** Lxd connection
   Ansible has a =lxd= connection, which can be used to manage lxd
   containers.
   #+begin_src conf
     [lxdui]
     lxdui01 ansible_host=lxdui01
     lxdui02 ansible_host=lxdui02
     [lxdui:vars]
     ansible_user=root
     ansible_connection=lxd
   #+end_src

   To ping:
   #+begin_src sh
     ansible -m ping lxdui -vvvvv #=>

     ansible 2.7.6
     <lxdui01> ESTABLISH LXD CONNECTION FOR USER: root
     <lxdui01> EXEC /bin/sh -c 'echo ~root && sleep 0'
     <lxdui02> ESTABLISH LXD CONNECTION FOR USER: root
     lxdui02 | SUCCESS => {
         "changed": false,
         "invocation": {
             "module_args": {
                 "data": "pong"
             }
         },
         "ping": "pong"
     }
     lxdui01 | SUCCESS => {
         "changed": false,
         "invocation": {
             "module_args": {
                 "data": "pong"
             }
         },
         "ping": "pong"
     }
     META: ran handlers
     META: ran handlers
   #+end_src

   It can work without ssh:
   #+begin_src sh
     ansible (client) -> lxc (client) -> lxd api(server) -> lxd containers
   #+end_src
