lxd.html
<div id="outline-container-orgd0a5b21" class="outline-2">
<h2 id="orgd0a5b21">Ansible</h2>
<div class="outline-text-2" id="text-orgd0a5b21">
</div>
<div id="outline-container-orgc1ee722" class="outline-3">
<h3 id="orgc1ee722">Lxd connection</h3>
<div class="outline-text-3" id="text-orgc1ee722">
<p>
Ansible has a <code>lxd</code> connection, which can be used to manage lxd
containers.
</p>
<div class="org-src-container">
<pre class="src src-conf">[<span style="color: #8cc4ff;">lxdui</span>]
<span style="color: #fcaf3e;">lxdui01 ansible_host</span>=lxdui01
<span style="color: #fcaf3e;">lxdui02 ansible_host</span>=lxdui02
[<span style="color: #8cc4ff;">lxdui:vars</span>]
<span style="color: #fcaf3e;">ansible_user</span>=root
<span style="color: #fcaf3e;">ansible_connection</span>=lxd
</pre>
</div>

<p>
To ping:
</p>
<div class="org-src-container">
<pre class="src src-sh">ansible -m ping lxdui -vvvvv <span style="color: #73d216;">#</span><span style="color: #73d216;">=&gt;</span>

ansible 2.7.6
&lt;lxdui01&gt; ESTABLISH LXD CONNECTION FOR USER: root
&lt;lxdui01&gt; EXEC /bin/sh -c <span style="color: #e9b96e;">'echo ~root &amp;&amp; sleep 0'</span>
&lt;lxdui02&gt; ESTABLISH LXD CONNECTION FOR USER: root
lxdui02 | SUCCESS =&gt; {
    <span style="color: #e9b96e;">"changed"</span>: false,
    <span style="color: #e9b96e;">"invocation"</span>: {
        <span style="color: #e9b96e;">"module_args"</span>: {
            <span style="color: #e9b96e;">"data"</span>: <span style="color: #e9b96e;">"pong"</span>
        }
    },
    <span style="color: #e9b96e;">"ping"</span>: <span style="color: #e9b96e;">"pong"</span>
}
lxdui01 | SUCCESS =&gt; {
    <span style="color: #e9b96e;">"changed"</span>: false,
    <span style="color: #e9b96e;">"invocation"</span>: {
        <span style="color: #e9b96e;">"module_args"</span>: {
            <span style="color: #e9b96e;">"data"</span>: <span style="color: #e9b96e;">"pong"</span>
        }
    },
    <span style="color: #e9b96e;">"ping"</span>: <span style="color: #e9b96e;">"pong"</span>
}
META: ran handlers
META: ran handlers
</pre>
</div>

<p>
It can work without ssh:
</p>
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #fce94f;">ansible</span> (client) -&gt; lxc (client) -&gt; lxd api(server) -&gt; lxd containers
</pre>
</div>
</div>
</div>
</div>
</div>
</body>
</html>
